PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
#byte INDF0 = 0x000

#byte INDF1 = 0x001

#byte PCL = 0x002

struct STATUS {
   unsigned int C:1;
   unsigned int DC:1;
   unsigned int Z:1;
   unsigned int PD:1;
   unsigned int TO:1;
} STATUS;
#byte STATUS = 0x003

#word FSR0 = 0x004

#word FSR1 = 0x006

#byte BSR = 0x008

#byte WREG = 0x009

#byte PCLATH = 0x00A

struct INTCON {
   unsigned int INTEDG:1;
   unsigned int :5;
   unsigned int PEIE:1;
   unsigned int GIE:1;
} INTCON;
#byte INTCON = 0x00B

struct PORTA {
   unsigned int RA0:1;
   unsigned int RA1:1;
   unsigned int RA2:1;
   unsigned int RA3:1;
   unsigned int RA4:1;
   unsigned int RA5:1;
   unsigned int RA6:1;
   unsigned int RA7:1;
} PORTA;
#byte PORTA = 0x00C

struct PORTB {
   unsigned int RB0:1;
   unsigned int RB1:1;
   unsigned int RB2:1;
   unsigned int RB3:1;
   unsigned int RB4:1;
   unsigned int RB5:1;
   unsigned int RB6:1;
   unsigned int RB7:1;
} PORTB;
#byte PORTB = 0x00D

struct PORTC {
   unsigned int RC0:1;
   unsigned int RC1:1;
   unsigned int RC2:1;
   unsigned int RC3:1;
   unsigned int RC4:1;
   unsigned int RC5:1;
   unsigned int RC6:1;
   unsigned int RC7:1;
} PORTC;
#byte PORTC = 0x00E

struct PORTE {
   unsigned int RE0:1;
   unsigned int RE1:1;
   unsigned int RE2:1;
   unsigned int RE3:1;
   unsigned int RE4:1;
   unsigned int RE5:1;
   unsigned int RE6:1;
   unsigned int RE7:1;
} PORTE;
#byte PORTE = 0x010

struct TRISA {
   unsigned int TRISA0:1;
   unsigned int TRISA1:1;
   unsigned int TRISA2:1;
   unsigned int TRISA3:1;
   unsigned int TRISA4:1;
   unsigned int TRISA5:1;
   unsigned int TRISA6:1;
   unsigned int TRISA7:1;
} TRISA;
#byte TRISA = 0x011

struct TRISB {
   unsigned int TRISB0:1;
   unsigned int TRISB1:1;
   unsigned int TRISB2:1;
   unsigned int TRISB3:1;
   unsigned int TRISB4:1;
   unsigned int TRISB5:1;
   unsigned int TRISB6:1;
   unsigned int TRISB7:1;
} TRISB;
#byte TRISB = 0x012

struct TRISC {
   unsigned int TRISC0:1;
   unsigned int TRISC1:1;
   unsigned int TRISC2:1;
   unsigned int TRISC3:1;
   unsigned int TRISC4:1;
   unsigned int TRISC5:1;
   unsigned int TRISC6:1;
   unsigned int TRISC7:1;
} TRISC;
#byte TRISC = 0x013

struct LATA {
   unsigned int LATA0:1;
   unsigned int LATA1:1;
   unsigned int LATA2:1;
   unsigned int LATA3:1;
   unsigned int LATA4:1;
   unsigned int LATA5:1;
   unsigned int LATA6:1;
   unsigned int LATA7:1;
} LATA;
#byte LATA = 0x016

struct LATB {
   unsigned int LATB0:1;
   unsigned int LATB1:1;
   unsigned int LATB2:1;
   unsigned int LATB3:1;
   unsigned int LATB4:1;
   unsigned int LATB5:1;
   unsigned int LATB6:1;
   unsigned int LATB7:1;
} LATB;
#byte LATB = 0x017

struct LATC {
   unsigned int LATC0:1;
   unsigned int LATC1:1;
   unsigned int LATC2:1;
   unsigned int LATC3:1;
   unsigned int LATC4:1;
   unsigned int LATC5:1;
   unsigned int LATC6:1;
   unsigned int LATC7:1;
} LATC;
#byte LATC = 0x018

struct TMR0 {
   unsigned int TMR0L:8;
} TMR0;
#byte TMR0 = 0x01C

struct TMR0H {
   union {
      struct {
         unsigned int TMR0H:8;
      };

      struct {
         unsigned int T0PR:8;
      };
   };
} TMR0H;
#byte TMR0H = 0x01D

struct T0CON0 {
   unsigned int T0OUTPS:4;
   unsigned int T016BIT:1;
   unsigned int T0OUT:1;
   unsigned int T0OE:1;
   unsigned int T0EN:1;
} T0CON0;
#byte T0CON0 = 0x01E

struct T0CON1 {
   unsigned int T0CKPS:4;
   unsigned int T0ASYNC:1;
   unsigned int T0CS:3;
} T0CON1;
#byte T0CON1 = 0x01F

#word ADRES = 0x08C

struct ADCON0 {
   union {
      struct {
         unsigned int ADGO:1;
         unsigned int :1;
         unsigned int ADFM:2;
         unsigned int ADCS:1;
         unsigned int :1;
         unsigned int ADCONT:1;
         unsigned int ADON:1;
      };

   union {
      struct {
         unsigned int DONE:1;
         unsigned int :1;
         unsigned int ADFRM:2;
      };
   };

      struct {
         unsigned int GO:1;
      };
   };
} ADCON0;
#byte ADCON0 = 0x093

struct ADCON1 {
   unsigned int ADDSEN:1;
   unsigned int :4;
   unsigned int ADGPOL:1;
   unsigned int ADIPEN:1;
   unsigned int ADPPOL:1;
} ADCON1;
#byte ADCON1 = 0x094

struct ADCON2 {
   unsigned int ADMD:3;
   unsigned int ADACLR:1;
   unsigned int ADCRS:3;
   unsigned int ADPSIS:1;
} ADCON2;
#byte ADCON2 = 0x095

struct ADCON3 {
   unsigned int ADTMD:3;
   unsigned int ADSOI:1;
   unsigned int ADCALC:3;
} ADCON3;
#byte ADCON3 = 0x096

struct ADSTAT {
   unsigned int ADSTAT:3;
   unsigned int ADMACT:1;
   unsigned int ADMATH:1;
   unsigned int ADLTHR:1;
   unsigned int ADUTHR:1;
   unsigned int ADAOV:1;
} ADSTAT;
#byte ADSTAT = 0x097

#byte ADACT = 0x099

#byte RC1REG = 0x119

#byte TX1REG = 0x11A

#word SP1BRG = 0x11B

struct RC1STA {
   unsigned int RX9D:1;
   unsigned int OERR:1;
   unsigned int FERR:1;
   unsigned int ADDEN:1;
   unsigned int CREN:1;
   unsigned int SREN:1;
   unsigned int RX9:1;
   unsigned int SPEN:1;
} RC1STA;
#byte RC1STA = 0x11D

struct TX1STA {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX9:1;
   unsigned int CSRC:1;
} TX1STA;
#byte TX1STA = 0x11E

struct BAUD1CON {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG16:1;
   unsigned int SCKP:1;
   unsigned int :1;
   unsigned int RCIDL:1;
   unsigned int ABDOVF:1;
} BAUD1CON;
#byte BAUD1CON = 0x11F

#byte SSP1BUF = 0x18C


struct SSP1ADD {
   unsigned int MSK:8;
} SSP1ADD;
#byte SSP1ADD = 0x18D


struct SSP1MSK {
   unsigned int MSK:8;
} SSP1MSK;
#byte SSP1MSK = 0x18E

struct SSP1STAT {
   union {
      struct {
         unsigned int BF:1;
         unsigned int UA:1;
         unsigned int R:1;
         unsigned int S:1;
         unsigned int P:1;
         unsigned int D:1;
         unsigned int CKE:1;
         unsigned int SMP:1;
      };

   union {
      struct {
         unsigned int :2;
         unsigned int R_W:1;
         unsigned int :2;
         unsigned int D_A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int W:1;
         unsigned int :2;
         unsigned int A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int WRITE:1;
         unsigned int S2:1;
         unsigned int P2:1;
         unsigned int ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int READ_WRITE:1;
         unsigned int I2C_START:1;
         unsigned int I2C_STOP:1;
         unsigned int DATA_ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int BF1:1;
         unsigned int UA1:1;
         unsigned int I2C_READ:1;
         unsigned int START:1;
         unsigned int STOP:1;
         unsigned int I2C_DAT:1;
         unsigned int CKE1:1;
         unsigned int SMP1:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int RW:1;
         unsigned int I2C_START1:1;
         unsigned int I2C_STOP2:1;
         unsigned int DA:1;
      };
   };

