PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int CAL01:1;
         unsigned int CAL11:1;
         unsigned int CAL21:1;
         unsigned int CAL31:1;
         unsigned int CAL41:1;
         unsigned int :1;
         unsigned int CAL61:1;
         unsigned int CAL71:1;
      };
   };
} TMR1;
#byte TMR1 = 0x20C

struct TMR1H {
   union {
      struct {
         unsigned int TMR1H:8;
      };

   union {
      struct {
         unsigned int :8;
      };
   };

      struct {
         unsigned int TMR18:2;
         unsigned int TMR11:6;
      };
   };
} TMR1H;
#byte TMR1H = 0x20D

struct T1CON {
   union {
      struct {
         unsigned int ON:1;
         unsigned int RD16:1;
         unsigned int SYNC:1;
         unsigned int :1;
         unsigned int CKPS:2;
      };

      struct {
         unsigned int TMR1ON:1;
         unsigned int T1RD16:1;
         unsigned int T1SYNC:1;
         unsigned int :1;
         unsigned int T1CKPS:2;
      };
   };
} T1CON;
#byte T1CON = 0x20E

struct T1GCON {
   union {
      struct {
         unsigned int :2;
         unsigned int GVAL:1;
         unsigned int GGO:1;
         unsigned int GSPM:1;
         unsigned int GTM:1;
         unsigned int GPOL:1;
         unsigned int GE:1;
      };

      struct {
         unsigned int :2;
         unsigned int T1GVAL:1;
         unsigned int T1GGO:1;
         unsigned int T1GSPM:1;
         unsigned int T1GTM:1;
         unsigned int T1GPOL:1;
         unsigned int T1GE:1;
      };
   };
} T1GCON;
#byte T1GCON = 0x20F

struct TMR3L {
   union {
      struct {
         unsigned int TMR3L:8;
      };

   union {
      struct {
         unsigned int TMR3:8;
      };
   };

      struct {
         unsigned int CAL03:1;
         unsigned int CAL13:1;
         unsigned int CAL23:1;
         unsigned int CAL33:1;
         unsigned int CAL43:1;
         unsigned int CAL53:1;
         unsigned int CAL63:1;
      };
   };
} TMR3;
#byte TMR3 = 0x212

struct TMR3H {
   union {
      struct {
         unsigned int TMR3H:8;
      };

      struct {
         unsigned int TMR38:2;
         unsigned int TMR31:6;
      };
   };
} TMR3H;
#byte TMR3H = 0x213

struct T3CON {
   union {
      struct {
         unsigned int ON:1;
         unsigned int RD16:1;
         unsigned int SYNC:1;
         unsigned int :1;
         unsigned int CKPS:2;
      };

   union {
      struct {
         unsigned int TMR3ON:1;
         unsigned int T3RD16:1;
         unsigned int T3SYNC:1;
         unsigned int :1;
         unsigned int T3CKPS:2;
      };
   };

      struct {
         unsigned int :1;
         unsigned int RD163:1;
      };
   };
} T3CON;
#byte T3CON = 0x214

struct T3GCON {
   union {
      struct {
         unsigned int :2;
         unsigned int GVAL:1;
         unsigned int GGO:1;
         unsigned int GSPM:1;
         unsigned int GTM:1;
         unsigned int GPOL:1;
         unsigned int GE:1;
      };

      struct {
         unsigned int :2;
         unsigned int T3GVAL:1;
         unsigned int T3GGO:1;
         unsigned int T3GSPM:1;
         unsigned int T3GTM:1;
         unsigned int T3GPOL:1;
         unsigned int T3GE:1;
      };
   };
} T3GCON;
#byte T3GCON = 0x215

struct TMR5L {
   union {
      struct {
         unsigned int TMR5L:8;
      };

   union {
      struct {
         unsigned int TMR5:8;
      };
   };

      struct {
         unsigned int CAL05:1;
         unsigned int CAL15:1;
         unsigned int CAL25:1;
         unsigned int CAL35:1;
         unsigned int CAL45:1;
         unsigned int CAL55:1;
         unsigned int CAL65:1;
         unsigned int CAL75:1;
      };
   };
} TMR5;
#byte TMR5 = 0x218

struct TMR5H {
   union {
      struct {
         unsigned int TMR5H:8;
      };

      struct {
         unsigned int TMR58:2;
         unsigned int TMR51:6;
      };
   };
} TMR5H;
#byte TMR5H = 0x219

struct T5CON {
   union {
      struct {
         unsigned int ON:1;
         unsigned int RD16:1;
         unsigned int SYNC:1;
         unsigned int :1;
         unsigned int CKPS:2;
      };

   union {
      struct {
         unsigned int TMR5ON:1;
         unsigned int T5RD16:1;
         unsigned int T5SYNC:1;
         unsigned int :1;
         unsigned int T5CKPS:2;
      };
   };

      struct {
         unsigned int :1;
         unsigned int RD165:1;
      };
   };
} T5CON;
#byte T5CON = 0x21A

struct T5GCON {
   union {
      struct {
         unsigned int :2;
         unsigned int GVAL:1;
         unsigned int GGO:1;
         unsigned int GSPM:1;
         unsigned int GTM:1;
         unsigned int GPOL:1;
         unsigned int GE:1;
      };

      struct {
         unsigned int :2;
         unsigned int T5GVAL:1;
         unsigned int T5GGO:1;
         unsigned int T5GSPM:1;
         unsigned int T5GTM:1;
         unsigned int T5GPOL:1;
         unsigned int T5GE:1;
      };
   };
} T5GCON;
#byte T5GCON = 0x21B

struct CCPTMRS0 {
   unsigned int C1TSEL:2;
   unsigned int C2TSEL:2;
   unsigned int C3TSEL:2;
   unsigned int C4TSEL:2;
} CCPTMRS0;
#byte CCPTMRS0 = 0x21E

struct CCPTMRS1 {
   unsigned int C5TSEL:2;
   unsigned int P6TSEL:2;
   unsigned int P7TSEL:2;
} CCPTMRS1;
#byte CCPTMRS1 = 0x21F

#byte T2TMR = 0x28C

#byte T2PR = 0x28D

struct T2CON {
   union {
      struct {
         unsigned int OUTPS:4;
         unsigned int CKPS:3;
         unsigned int ON:1;
      };

   union {
      struct {
         unsigned int T2OUTPS:4;
         unsigned int T2CKPS:3;
         unsigned int T2ON:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int TMR2ON:1;
      };
   };
} T2CON;
#byte T2CON = 0x28E

struct T2HLT {
   union {
      struct {
         unsigned int MODE:5;
         unsigned int CKSYNC:1;
         unsigned int CKPOL:1;
         unsigned int PSYNC:1;
      };

      struct {
         unsigned int T2MODE:5;
         unsigned int T2CKSYNC:1;
         unsigned int T2CKPOL:1;
         unsigned int T2PSYNC:1;
      };
   };
} T2HLT;
#byte T2HLT = 0x28F

#byte T2RST = 0x291

#byte T4TMR = 0x292

#byte T4PR = 0x293

