PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
struct T4CON {
   union {
      struct {
         unsigned int OUTPS:4;
         unsigned int CKPS:3;
         unsigned int ON:1;
      };

   union {
      struct {
         unsigned int T4OUTPS:4;
         unsigned int T4CKPS:3;
         unsigned int T4ON:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int TMR4ON:1;
      };
   };
} T4CON;
#byte T4CON = 0x294

struct T4HLT {
   union {
      struct {
         unsigned int MODE:5;
         unsigned int CKSYNC:1;
         unsigned int CKPOL:1;
         unsigned int PSYNC:1;
      };

      struct {
         unsigned int T4MODE:5;
         unsigned int T4CKSYNC:1;
         unsigned int T4CKPOL:1;
         unsigned int T4PSYNC:1;
      };
   };
} T4HLT;
#byte T4HLT = 0x295

#byte T4RST = 0x297

#byte T6TMR = 0x298

#byte T6PR = 0x299

struct T6CON {
   union {
      struct {
         unsigned int OUTPS:4;
         unsigned int CKPS:3;
         unsigned int ON:1;
      };

   union {
      struct {
         unsigned int T6OUTPS:4;
         unsigned int T6CKPS:3;
         unsigned int T6ON:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int TMR6ON:1;
      };
   };
} T6CON;
#byte T6CON = 0x29A

struct T6HLT {
   union {
      struct {
         unsigned int MODE:5;
         unsigned int CKSYNC:1;
         unsigned int CKPOL:1;
         unsigned int PSYNC:1;
      };

      struct {
         unsigned int T6MODE:5;
         unsigned int T6CKSYNC:1;
         unsigned int T6CKPOL:1;
         unsigned int T6PSYNC:1;
      };
   };
} T6HLT;
#byte T6HLT = 0x29B

#byte T6RST = 0x29D

#word CCPR1 = 0x30C

struct CCP1CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP1MODE:4;
         unsigned int CCP1FMT:1;
         unsigned int CCP1OUT:1;
         unsigned int CCP1OE:1;
         unsigned int CCP1EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P1M:2;
      };
   };
} CCP1CON;
#byte CCP1CON = 0x30E


struct CCP1CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP1CTS:8;
      };
   };
} CCP1CAP;
#byte CCP1CAP = 0x30F

#word CCPR2 = 0x310

struct CCP2CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP2MODE:4;
         unsigned int CCP2FMT:1;
         unsigned int CCP2OUT:1;
         unsigned int CCP2OE:1;
         unsigned int CCP2EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P2M:2;
      };
   };
} CCP2CON;
#byte CCP2CON = 0x312


struct CCP2CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP2CTS:8;
      };
   };
} CCP2CAP;
#byte CCP2CAP = 0x313

#word CCPR3 = 0x314

struct CCP3CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP3MODE:4;
         unsigned int CCP3FMT:1;
         unsigned int CCP3OUT:1;
         unsigned int CCP3OE:1;
         unsigned int CCP3EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P3M:2;
      };
   };
} CCP3CON;
#byte CCP3CON = 0x316


struct CCP3CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP3CTS:8;
      };
   };
} CCP3CAP;
#byte CCP3CAP = 0x317

#word CCPR4 = 0x318

struct CCP4CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP4MODE:4;
         unsigned int CCP4FMT:1;
         unsigned int CCP4OUT:1;
         unsigned int CCP4OE:1;
         unsigned int CCP4EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P4M:2;
      };
   };
} CCP4CON;
#byte CCP4CON = 0x31A


struct CCP4CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP4CTS:8;
      };
   };
} CCP4CAP;
#byte CCP4CAP = 0x31B

#word CCPR5 = 0x31C

struct CCP5CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP5MODE:4;
         unsigned int CCP5FMT:1;
         unsigned int CCP5OUT:1;
         unsigned int CCP5OE:1;
         unsigned int CCP5EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P5M:2;
      };
   };
} CCP5CON;
#byte CCP5CON = 0x31E

struct PWM6DCL {
   union {
      struct {
         unsigned int :6;
         unsigned int DC:2;
      };

   union {
      struct {
         unsigned int :6;
         unsigned int PWM6DC:2;
      };
   };

      struct {
         unsigned int :6;
         unsigned int PWMPW:2;
      };
   };
} PWM6DC;
#byte PWM6DC = 0x38C

struct PWM6DCH {
   union {
      struct {
         unsigned int DC2:8;
      };

   union {
      struct {
         unsigned int PWM6DC2:8;
      };
   };

      struct {
         unsigned int PWMPW2:8;
      };
   };
} PWM6DCH;
#byte PWM6DCH = 0x38D

struct PWM6CON {
   union {
      struct {
         unsigned int :4;
         unsigned int POL:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

      struct {
         unsigned int :4;
         unsigned int PWM6POL:1;
         unsigned int PWM6OUT:1;
         unsigned int PWM6OE:1;
         unsigned int PWM6EN:1;
      };
   };
} PWM6CON;
#byte PWM6CON = 0x38E

struct SCANLADRL {
   union {
      struct {
         unsigned int LADR:8;
      };

