PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int SCANLADR:8;
      };
   };
} SCANLADR;
#byte SCANLADR = 0x40C

struct SCANLADRH {
   union {
      struct {
         unsigned int LADR8:2;
         unsigned int LADR1:6;
      };

      struct {
         unsigned int SCANLADR8:2;
         unsigned int SCANLADR1:6;
      };
   };
} SCANLADRH;
#byte SCANLADRH = 0x40D

struct SCANHADRL {
   union {
      struct {
         unsigned int HADR:8;
      };

      struct {
         unsigned int SCANHADR:8;
      };
   };
} SCANHADR;
#byte SCANHADR = 0x40E

struct SCANHADRH {
   union {
      struct {
         unsigned int HADR8:2;
         unsigned int HADR1:6;
      };

      struct {
         unsigned int SCANHADR8:2;
         unsigned int SCANHADR1:6;
      };
   };
} SCANHADRH;
#byte SCANHADRH = 0x40F

struct SCANCON0 {
   union {
      struct {
         unsigned int MODE:2;
         unsigned int :1;
         unsigned int INTM:1;
         unsigned int INVALID:1;
         unsigned int BUSY:1;
         unsigned int SCANGO:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int SCANMODE:2;
         unsigned int :1;
         unsigned int SCANINTM:1;
         unsigned int SCANINVALID:1;
         unsigned int SCANBUSY:1;
         unsigned int :1;
         unsigned int SCANEN:1;
      };
   };

      struct {
         unsigned int :4;
         unsigned int DABORT:1;
      };
   };
} SCANCON0;
#byte SCANCON0 = 0x410

#byte SCANTRIG = 0x411

struct CRCDAT {
   unsigned int DATA:8;
} CRCDAT;
#byte CRCDAT = 0x416

struct CRCDATH {
   unsigned int DATA8:2;
   unsigned int DATA1:6;
} CRCDATH;
#byte CRCDATH = 0x417

struct CRCACC {
   unsigned int ACC:8;
} CRCACC;
#byte CRCACC = 0x418

struct CRCACCH {
   unsigned int ACC8:2;
   unsigned int ACC1:6;
} CRCACCH;
#byte CRCACCH = 0x419

struct CRCSHIFT {
   unsigned int SHFT:8;
} CRCSHIFT;
#byte CRCSHIFT = 0x41A

struct CRCSHIFTH {
   unsigned int SHFT8:2;
   unsigned int SHFT1:6;
} CRCSHIFTH;
#byte CRCSHIFTH = 0x41B

struct CRCXOR {
   unsigned int :1;
   unsigned int X1:7;
} CRCXOR;
#byte CRCXOR = 0x41C

struct CRCXORH {
   unsigned int X8:2;
   unsigned int X1:6;
} CRCXORH;
#byte CRCXORH = 0x41D

struct CRCCON0 {
   union {
      struct {
         unsigned int FULL:1;
         unsigned int SHIFTM:1;
         unsigned int :2;
         unsigned int ACCM:1;
         unsigned int BUSY:1;
         unsigned int CRCGO:1;
         unsigned int EN:1;
      };

      struct {
         unsigned int :7;
         unsigned int CRCEN:1;
      };
   };
} CRCCON0;
#byte CRCCON0 = 0x41E

struct CRCCON1 {
   unsigned int PLEN:4;
   unsigned int DLEN:4;
} CRCCON1;
#byte CRCCON1 = 0x41F

struct SMT1TMRL {
   union {
      struct {
         unsigned int TMR:8;
      };

      struct {
         unsigned int SMT1TMR:8;
      };
   };
} SMT1TMR;
#byte SMT1TMR = 0x48C

struct SMT1TMRH {
   union {
      struct {
         unsigned int TMR8:2;
         unsigned int TMR1:6;
      };

      struct {
         unsigned int SMT1TMR8:2;
         unsigned int SMT1TMR1:6;
      };
   };
} SMT1TMRH;
#byte SMT1TMRH = 0x48D

struct SMT1TMRU {
   union {
      struct {
         unsigned int TMR16:4;
         unsigned int TMR2:4;
      };

      struct {
         unsigned int SMT1TMR16:4;
         unsigned int SMT1TMR2:4;
      };
   };
} SMT1TMRU;
#byte SMT1TMRU = 0x48E

struct SMT1CPRL {
   union {
      struct {
         unsigned int CPR:8;
      };

      struct {
         unsigned int SMT1CPR:8;
      };
   };
} SMT1CPR;
#byte SMT1CPR = 0x48F

struct SMT1CPRH {
   union {
      struct {
         unsigned int CPR8:2;
         unsigned int CPR1:6;
      };

      struct {
         unsigned int SMT1CPR8:2;
         unsigned int SMT1CPR1:6;
      };
   };
} SMT1CPRH;
#byte SMT1CPRH = 0x490

struct SMT1CPRU {
   union {
      struct {
         unsigned int CPR16:4;
         unsigned int CPR2:4;
      };

      struct {
         unsigned int SMT1CPR16:4;
         unsigned int SMT1CPR2:4;
      };
   };
} SMT1CPRU;
#byte SMT1CPRU = 0x491

struct SMT1CPWL {
   union {
      struct {
         unsigned int CPW:8;
      };

      struct {
         unsigned int SMT1CPW:8;
      };
   };
} SMT1CPW;
#byte SMT1CPW = 0x492

struct SMT1CPWH {
   union {
      struct {
         unsigned int CPW8:2;
         unsigned int CPW1:6;
      };

      struct {
         unsigned int SMT1CPW8:2;
         unsigned int SMT1CPW1:6;
      };
   };
} SMT1CPWH;
#byte SMT1CPWH = 0x493

struct SMT1CPWU {
   union {
      struct {
         unsigned int CPW16:4;
         unsigned int CPW2:4;
      };

      struct {
         unsigned int SMT1CPW16:4;
         unsigned int SMT1CPW2:4;
      };
   };
} SMT1CPWU;
#byte SMT1CPWU = 0x494

struct SMT1PRL {
   union {
      struct {
         unsigned int PR:8;
      };

      struct {
         unsigned int SMT1PR:8;
      };
   };
} SMT1PR;
#byte SMT1PR = 0x495

struct SMT1PRH {
   union {
      struct {
         unsigned int PR8:2;
         unsigned int PR1:6;
      };

      struct {
         unsigned int SMT1PR8:2;
         unsigned int SMT1PR1:6;
      };
   };
} SMT1PRH;
#byte SMT1PRH = 0x496

struct SMT1PRU {
   union {
      struct {
         unsigned int PR16:4;
         unsigned int PR2:4;
      };

      struct {
         unsigned int SMT1PR16:4;
         unsigned int SMT1PR2:4;
      };
   };
} SMT1PRU;
#byte SMT1PRU = 0x497

struct SMT1CON0 {
   union {
      struct {
         unsigned int PS:2;
         unsigned int CPOL:1;
         unsigned int SPOL:1;
         unsigned int WPOL:1;
         unsigned int STP:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int SMT1PS:2;
         unsigned int SMT1CPOL:1;
         unsigned int SMT1SPOL:1;
         unsigned int SMT1WOL:1;
         unsigned int SMT1STP:1;
         unsigned int :1;
         unsigned int SMT1EN:1;
      };
   };
} SMT1CON0;
#byte SMT1CON0 = 0x498

struct SMT1CON1 {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int :2;
         unsigned int REPEAT:1;
         unsigned int GO:1;
      };

