PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int :6;
         unsigned int SMT1REPEAT:1;
         unsigned int SMT1GO:1;
      };
   };
} SMT1CON1;
#byte SMT1CON1 = 0x499

struct SMT1STAT {
   union {
      struct {
         unsigned int AS:1;
         unsigned int WS:1;
         unsigned int TS:1;
         unsigned int :2;
         unsigned int RST:1;
         unsigned int CPWUP:1;
         unsigned int CPRUP:1;
      };

   union {
      struct {
         unsigned int SMT1AS:1;
         unsigned int SMT1WS:1;
         unsigned int SMT1TS:1;
         unsigned int :2;
         unsigned int SMT1RESET:1;
         unsigned int SMT1CPWUP:1;
         unsigned int SMT1CPRUP:1;
      };
   };

      struct {
         unsigned int :5;
         unsigned int SMT1RST:1;
      };
   };
} SMT1STAT;
#byte SMT1STAT = 0x49A

#byte SMT1CLK = 0x49B

#byte SMT1SIG = 0x49C

#byte SMT1WIN = 0x49D

struct SMT2TMRL {
   union {
      struct {
         unsigned int TMR:8;
      };

      struct {
         unsigned int SMT2TMR:8;
      };
   };
} SMT2TMR;
#byte SMT2TMR = 0x50C

struct SMT2TMRH {
   union {
      struct {
         unsigned int TMR8:2;
         unsigned int TMR1:6;
      };

      struct {
         unsigned int SMT2TMR8:2;
         unsigned int SMT2TMR1:6;
      };
   };
} SMT2TMRH;
#byte SMT2TMRH = 0x50D

struct SMT2TMRU {
   union {
      struct {
         unsigned int TMR16:4;
         unsigned int TMR2:4;
      };

      struct {
         unsigned int SMT2TMR16:4;
         unsigned int SMT2TMR2:4;
      };
   };
} SMT2TMRU;
#byte SMT2TMRU = 0x50E

struct SMT2CPRL {
   union {
      struct {
         unsigned int CPR:8;
      };

      struct {
         unsigned int SMT2CPR:8;
      };
   };
} SMT2CPR;
#byte SMT2CPR = 0x50F

struct SMT2CPRH {
   union {
      struct {
         unsigned int CPR8:2;
         unsigned int CPR1:6;
      };

      struct {
         unsigned int SMT2CPR8:2;
         unsigned int SMT2CPR1:6;
      };
   };
} SMT2CPRH;
#byte SMT2CPRH = 0x510

struct SMT2CPRU {
   union {
      struct {
         unsigned int CPR16:4;
         unsigned int CPR2:4;
      };

      struct {
         unsigned int SMT2CPR16:4;
         unsigned int SMT2CPR2:4;
      };
   };
} SMT2CPRU;
#byte SMT2CPRU = 0x511

struct SMT2CPWL {
   union {
      struct {
         unsigned int CPW:8;
      };

      struct {
         unsigned int SMT2CPW:8;
      };
   };
} SMT2CPW;
#byte SMT2CPW = 0x512

struct SMT2CPWH {
   union {
      struct {
         unsigned int CPW8:2;
         unsigned int CPW1:6;
      };

      struct {
         unsigned int SMT2CPW8:2;
         unsigned int SMT2CPW1:6;
      };
   };
} SMT2CPWH;
#byte SMT2CPWH = 0x513

struct SMT2CPWU {
   union {
      struct {
         unsigned int CPW16:4;
         unsigned int CPW2:4;
      };

      struct {
         unsigned int SMT2CPW16:4;
         unsigned int SMT2CPW2:4;
      };
   };
} SMT2CPWU;
#byte SMT2CPWU = 0x514

struct SMT2PRL {
   union {
      struct {
         unsigned int PR:8;
      };

      struct {
         unsigned int SMT2PR:8;
      };
   };
} SMT2PR;
#byte SMT2PR = 0x515

struct SMT2PRH {
   union {
      struct {
         unsigned int PR8:2;
         unsigned int PR1:6;
      };

      struct {
         unsigned int SMT2PR8:2;
         unsigned int SMT2PR1:6;
      };
   };
} SMT2PRH;
#byte SMT2PRH = 0x516

struct SMT2PRU {
   union {
      struct {
         unsigned int PR16:4;
         unsigned int PR2:4;
      };

      struct {
         unsigned int SMT2PR16:4;
         unsigned int SMT2PR2:4;
      };
   };
} SMT2PRU;
#byte SMT2PRU = 0x517

struct SMT2CON0 {
   union {
      struct {
         unsigned int PS:2;
         unsigned int CPOL:1;
         unsigned int SPOL:1;
         unsigned int WPOL:1;
         unsigned int STP:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int SMT2PS:2;
         unsigned int SMT2CPOL:1;
         unsigned int SMT2SPOL:1;
         unsigned int SMT2WOL:1;
         unsigned int SMT2STP:1;
         unsigned int :1;
         unsigned int SMT2EN:1;
      };
   };
} SMT2CON0;
#byte SMT2CON0 = 0x518

struct SMT2CON1 {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int :2;
         unsigned int REPEAT:1;
         unsigned int GO:1;
      };

      struct {
         unsigned int :6;
         unsigned int SMT2REPEAT:1;
         unsigned int SMT2GO:1;
      };
   };
} SMT2CON1;
#byte SMT2CON1 = 0x519

struct SMT2STAT {
   union {
      struct {
         unsigned int AS:1;
         unsigned int WS:1;
         unsigned int TS:1;
         unsigned int :2;
         unsigned int RST:1;
         unsigned int CPWUP:1;
         unsigned int CPRUP:1;
      };

   union {
      struct {
         unsigned int SMT2AS:1;
         unsigned int SMT2WS:1;
         unsigned int SMT2TS:1;
         unsigned int :2;
         unsigned int SMT2RESET:1;
         unsigned int SMT2CPWUP:1;
         unsigned int SMT2CPRUP:1;
      };
   };

      struct {
         unsigned int :5;
         unsigned int SMT2RST:1;
      };
   };
} SMT2STAT;
#byte SMT2STAT = 0x51A

#byte SMT2CLK = 0x51B

#byte SMT2SIG = 0x51C

#byte SMT2WIN = 0x51D

struct NCO1ACC {
   unsigned int NCO1ACC:8;
} NCO1ACC;
#byte NCO1ACC = 0x58C

struct NCO1ACCH {
   unsigned int NCO1ACC8:2;
   unsigned int NCO1ACC1:6;
} NCO1ACCH;
#byte NCO1ACCH = 0x58D

struct NCO1ACCU {
   unsigned int NCO1ACC16:4;
   unsigned int NCO1ACC2:4;
} NCO1ACCU;
#byte NCO1ACCU = 0x58E

struct NCO1INC {
   unsigned int NCO1INC:8;
} NCO1INC;
#byte NCO1INC = 0x58F

struct NCO1INCH {
   unsigned int NCO1INC8:2;
   unsigned int NCO1INC1:6;
} NCO1INCH;
#byte NCO1INCH = 0x590

struct NCO1INCU {
   unsigned int NCO1INC16:4;
   unsigned int NCO1INC2:4;
} NCO1INCU;
#byte NCO1INCU = 0x591

struct NCO1CON {
   unsigned int N1PFM:1;
   unsigned int :3;
   unsigned int N1POL:1;
   unsigned int N1OUT:1;
   unsigned int N1OE:1;
   unsigned int N1EN:1;
} NCO1CON;
#byte NCO1CON = 0x592

struct NCO1CLK {
   unsigned int N1CKS:4;
   unsigned int :1;
   unsigned int N1PWS:3;
} NCO1CLK;
#byte NCO1CLK = 0x593

struct CWG1CLKCON {
   union {
      struct {
         unsigned int CS:1;
      };

