PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int CWG1CS:1;
      };
   };
} CWG1CLKCON;
#byte CWG1CLKCON = 0x60C

#byte CWG1ISM = 0x60D

#byte CWG1DBR = 0x60E

#byte CWG1DBF = 0x60F

struct CWG1CON0 {
   union {
      struct {
         unsigned int MODE:3;
         unsigned int :3;
         unsigned int LD:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CWG1MODE:3;
         unsigned int :3;
         unsigned int CWG1LD:1;
         unsigned int G1EN:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int CWG1EN:1;
      };
   };
} CWG1CON0;
#byte CWG1CON0 = 0x610

struct CWG1CON1 {
   union {
      struct {
         unsigned int POLA:1;
         unsigned int POLB:1;
         unsigned int POLC:1;
         unsigned int POLD:1;
         unsigned int :1;
         unsigned int IN:1;
      };

      struct {
         unsigned int CWG1POLA:1;
         unsigned int CWG1POLB:1;
         unsigned int CWG1POLC:1;
         unsigned int CWG1POLD:1;
         unsigned int :1;
         unsigned int CWG1IN:1;
      };
   };
} CWG1CON1;
#byte CWG1CON1 = 0x611

struct CWG1AS0 {
   union {
      struct {
         unsigned int :2;
         unsigned int LSAC:2;
         unsigned int LSBD:2;
         unsigned int REN:1;
         unsigned int SHUTDOWN:1;
      };

      struct {
         unsigned int :2;
         unsigned int CWG1LSAC:2;
         unsigned int CWG1LSBD:2;
         unsigned int CWG1REN:1;
         unsigned int CWG1SHUTDOWN:1;
      };
   };
} CWG1AS0;
#byte CWG1AS0 = 0x612

struct CWG1AS1 {
   unsigned int AS0E:1;
   unsigned int AS1E:1;
   unsigned int AS2E:1;
   unsigned int AS3E:1;
   unsigned int AS4E:1;
   unsigned int AS5E:1;
   unsigned int AS6E:1;
} CWG1AS1;
#byte CWG1AS1 = 0x613

struct CWG1STR {
   union {
      struct {
         unsigned int STRA:1;
         unsigned int STRB:1;
         unsigned int STRC:1;
         unsigned int STRD:1;
         unsigned int OVRA:1;
         unsigned int OVRB:1;
         unsigned int OVRC:1;
         unsigned int OVRD:1;
      };

      struct {
         unsigned int CWG1STRA:1;
         unsigned int CWG1STRB:1;
         unsigned int CWG1STRC:1;
         unsigned int CWG1STRD:1;
         unsigned int CWG1OVRA:1;
         unsigned int CWG1OVRB:1;
         unsigned int CWG1OVRC:1;
         unsigned int CWG1OVRD:1;
      };
   };
} CWG1STR;
#byte CWG1STR = 0x614

struct CWG2CLKCON {
   union {
      struct {
         unsigned int CS:1;
      };

      struct {
         unsigned int CWG2CS:1;
      };
   };
} CWG2CLKCON;
#byte CWG2CLKCON = 0x616

#byte CWG2ISM = 0x617

#byte CWG2DBR = 0x618

#byte CWG2DBF = 0x619

struct CWG2CON0 {
   union {
      struct {
         unsigned int MODE:3;
         unsigned int :3;
         unsigned int LD:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CWG2MODE:3;
         unsigned int :3;
         unsigned int CWG2LD:1;
         unsigned int G2EN:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int CWG2EN:1;
      };
   };
} CWG2CON0;
#byte CWG2CON0 = 0x61A

struct CWG2CON1 {
   union {
      struct {
         unsigned int POLA:1;
         unsigned int POLB:1;
         unsigned int POLC:1;
         unsigned int POLD:1;
         unsigned int :1;
         unsigned int IN:1;
      };

      struct {
         unsigned int CWG2POLA:1;
         unsigned int CWG2POLB:1;
         unsigned int CWG2POLC:1;
         unsigned int CWG2POLD:1;
         unsigned int :1;
         unsigned int CWG2IN:1;
      };
   };
} CWG2CON1;
#byte CWG2CON1 = 0x61B

struct CWG2AS0 {
   union {
      struct {
         unsigned int :2;
         unsigned int LSAC:2;
         unsigned int LSBD:2;
         unsigned int REN:1;
         unsigned int SHUTDOWN:1;
      };

      struct {
         unsigned int :2;
         unsigned int CWG2LSAC:2;
         unsigned int CWG2LSBD:2;
         unsigned int CWG2REN:1;
         unsigned int CWG2SHUTDOWN:1;
      };
   };
} CWG2AS0;
#byte CWG2AS0 = 0x61C

struct CWG2AS1 {
   unsigned int AS0E:1;
   unsigned int AS1E:1;
   unsigned int AS2E:1;
   unsigned int AS3E:1;
   unsigned int AS4E:1;
   unsigned int AS5E:1;
   unsigned int AS6E:1;
} CWG2AS1;
#byte CWG2AS1 = 0x61D

struct CWG2STR {
   union {
      struct {
         unsigned int STRA:1;
         unsigned int STRB:1;
         unsigned int STRC:1;
         unsigned int STRD:1;
         unsigned int OVRA:1;
         unsigned int OVRB:1;
         unsigned int OVRC:1;
         unsigned int OVRD:1;
      };

      struct {
         unsigned int CWG2STRA:1;
         unsigned int CWG2STRB:1;
         unsigned int CWG2STRC:1;
         unsigned int CWG2STRD:1;
         unsigned int CWG2OVRA:1;
         unsigned int CWG2OVRB:1;
         unsigned int CWG2OVRC:1;
         unsigned int CWG2OVRD:1;
      };
   };
} CWG2STR;
#byte CWG2STR = 0x61E

struct PIR0 {
   unsigned int INTF:1;
   unsigned int :3;
   unsigned int IOCIF:1;
   unsigned int TMR0IF:1;
} PIR0;
#byte PIR0 = 0x70C

struct PIR1 {
   unsigned int ADIF:1;
   unsigned int ADTIF:1;
   unsigned int :4;
   unsigned int CSWIF:1;
   unsigned int OSFIF:1;
} PIR1;
#byte PIR1 = 0x70D

struct PIR2 {
   unsigned int C1IF:1;
   unsigned int C2IF:1;
   unsigned int :4;
   unsigned int ZCDIF:1;
} PIR2;
#byte PIR2 = 0x70E

struct PIR3 {
   unsigned int SSP1IF:1;
   unsigned int BCL1IF:1;
   unsigned int SSP2IF:1;
   unsigned int BCL2IF:1;
   unsigned int TXIF:1;
   unsigned int RCIF:1;
} PIR3;
#byte PIR3 = 0x70F

struct PIR4 {
   unsigned int TMR1IF:1;
   unsigned int TMR2IF:1;
   unsigned int TMR3IF:1;
   unsigned int TMR4IF:1;
   unsigned int TMR5IF:1;
   unsigned int TMR6IF:1;
} PIR4;
#byte PIR4 = 0x710

struct PIR5 {
   unsigned int TMR1GIF:1;
   unsigned int TMR3GIF:1;
   unsigned int TMR5GIF:1;
   unsigned int :1;
   unsigned int CLC1IF:1;
   unsigned int CLC2IF:1;
   unsigned int CLC3IF:1;
   unsigned int CLC4IF:1;
} PIR5;
#byte PIR5 = 0x711

struct PIR6 {
   unsigned int CCP1IF:1;
   unsigned int CCP2IF:1;
   unsigned int CCP3IF:1;
   unsigned int CCP4IF:1;
   unsigned int CCP5IF:1;
} PIR6;
