PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
#byte PIR6 = 0x712

struct PIE0 {
   unsigned int INTE:1;
   unsigned int :3;
   unsigned int IOCIE:1;
   unsigned int TMR0IE:1;
} PIE0;
#byte PIE0 = 0x716

struct PIE1 {
   unsigned int ADIE:1;
   unsigned int ADTIE:1;
   unsigned int :4;
   unsigned int CSWIE:1;
   unsigned int OSFIE:1;
} PIE1;
#byte PIE1 = 0x717

struct PIE2 {
   unsigned int C1IE:1;
   unsigned int C2IE:1;
   unsigned int :4;
   unsigned int ZCDIE:1;
} PIE2;
#byte PIE2 = 0x718

struct PIE3 {
   unsigned int SSP1IE:1;
   unsigned int BCL1IE:1;
   unsigned int SSP2IE:1;
   unsigned int BCL2IE:1;
   unsigned int TXIE:1;
   unsigned int RCIE:1;
} PIE3;
#byte PIE3 = 0x719

struct PIE4 {
   unsigned int TMR1IE:1;
   unsigned int TMR2IE:1;
   unsigned int TMR3IE:1;
   unsigned int TMR4IE:1;
   unsigned int TMR5IE:1;
   unsigned int TMR6IE:1;
} PIE4;
#byte PIE4 = 0x71A

struct PIE5 {
   unsigned int TMR1GIE:1;
   unsigned int TMR3GIE:1;
   unsigned int TMR5GIE:1;
   unsigned int :1;
   unsigned int CLC1IE:1;
   unsigned int CLC2IE:1;
   unsigned int CLC3IE:1;
   unsigned int CLC4IE:1;
} PIE5;
#byte PIE5 = 0x71B

struct PIE6 {
   unsigned int CCP1IE:1;
   unsigned int CCP2IE:1;
   unsigned int CCP3IE:1;
   unsigned int CCP4IE:1;
   unsigned int CCP5IE:1;
} PIE6;
#byte PIE6 = 0x71C

struct PMD0 {
   unsigned int IOCMD:1;
   unsigned int CLKRMD:1;
   unsigned int NVMMD:1;
   unsigned int SCANMD:1;
   unsigned int CRCMD:1;
   unsigned int :1;
   unsigned int FVRMD:1;
   unsigned int SYSCMD:1;
} PMD0;
#byte PMD0 = 0x796

struct PMD1 {
   union {
      struct {
         unsigned int TMR0MD:1;
         unsigned int TMR1MD:1;
         unsigned int TMR2MD:1;
         unsigned int TMR3MD:1;
         unsigned int TMR4MD:1;
         unsigned int TMR5MD:1;
         unsigned int TMR6MD:1;
         unsigned int NCOMD:1;
      };

      struct {
         unsigned int :7;
         unsigned int NCO1MD:1;
      };
   };
} PMD1;
#byte PMD1 = 0x797

struct PMD2 {
   unsigned int ZCDMD:1;
   unsigned int CMP1MD:1;
   unsigned int CMP2MD:1;
   unsigned int :2;
   unsigned int ADCMD:1;
   unsigned int DACMD:1;
} PMD2;
#byte PMD2 = 0x798

struct PMD3 {
   unsigned int CCP1MD:1;
   unsigned int CCP2MD:1;
   unsigned int CCP3MD:1;
   unsigned int CCP4MD:1;
   unsigned int CCP5MD:1;
   unsigned int PWM6MD:1;
   unsigned int PWM7MD:1;
} PMD3;
#byte PMD3 = 0x799

struct PMD4 {
   unsigned int CWG1MD:1;
   unsigned int CWG2MD:1;
   unsigned int CWG3MD:1;
   unsigned int :1;
   unsigned int MSSP1MD:1;
   unsigned int MSSP2MD:1;
   unsigned int UART1MD:1;
} PMD4;
#byte PMD4 = 0x79A

struct PMD5 {
   unsigned int DSMMD:1;
   unsigned int CLC1MD:1;
   unsigned int CLC2MD:1;
   unsigned int CLC3MD:1;
   unsigned int CLC4MD:1;
   unsigned int :1;
   unsigned int SMT1MD:1;
   unsigned int SMT2MD:1;
} PMD5;
#byte PMD5 = 0x79B

struct WDTCON0 {
   union {
      struct {
         unsigned int SEN:1;
         unsigned int WDTPS:5;
      };

   union {
      struct {
         unsigned int SWDTEN:1;
      };
   };

      struct {
         unsigned int WDTSEN:1;
      };
   };
} WDTCON0;
#byte WDTCON0 = 0x80C

struct WDTCON1 {
   union {
      struct {
         unsigned int WINDOW:3;
         unsigned int :1;
         unsigned int WDTCS:3;
      };

      struct {
         unsigned int WDTWINDOW:3;
      };
   };
} WDTCON1;
#byte WDTCON1 = 0x80D

struct WDTPSL {
   union {
      struct {
         unsigned int PSCNT:8;
      };

      struct {
         unsigned int WDTPSCNT:8;
      };
   };
} WDTPS;
#byte WDTPS = 0x80E

struct WDTPSH {
   union {
      struct {
         unsigned int PSCNT8:2;
         unsigned int PSCNT1:6;
      };

      struct {
         unsigned int WDTPSCNT8:2;
         unsigned int WDTPSCNT1:6;
      };
   };
} WDTPSH;
#byte WDTPSH = 0x80F

struct WDTTMR {
   union {
      struct {
         unsigned int PSCNT16:2;
         unsigned int STATE:1;
         unsigned int WDTTMR:5;
      };

      struct {
         unsigned int WDTPSCNT16:2;
         unsigned int WDTSTATE:1;
      };
   };
} WDTTMR;
#byte WDTTMR = 0x810

struct BORCON {
   unsigned int BORRDY:1;
   unsigned int :6;
   unsigned int SBOREN:1;
} BORCON;
#byte BORCON = 0x811


struct VREGCON {
   unsigned int :1;
   unsigned int VREGPM:1;
} VREGCON;
#byte VREGCON = 0x812

struct PCON0 {
   unsigned int BOR:1;
   unsigned int POR:1;
   unsigned int RI:1;
   unsigned int RMCLR:1;
   unsigned int RWDT:1;
   unsigned int WDTWV:1;
   unsigned int STKUNF:1;
   unsigned int STKOVF:1;
} PCON0;
#byte PCON0 = 0x813

struct CCDCON {
   unsigned int CCDS:2;
   unsigned int :5;
   unsigned int CCDEN:1;
} CCDCON;
#byte CCDCON = 0x814

struct NVMADR {
   unsigned int NVMADR:8;
} NVMADR;
#byte NVMADR = 0x81A

struct NVMADRH {
   unsigned int NVMADR8:2;
   unsigned int NVMADR1:5;
} NVMADRH;
#byte NVMADRH = 0x81B

struct NVMDAT {
   unsigned int NVMDAT:8;
} NVMDAT;
#byte NVMDAT = 0x81C

struct NVMDATH {
   unsigned int NVMDAT8:2;
   unsigned int NVMDAT1:4;
} NVMDATH;
#byte NVMDATH = 0x81D

struct NVMCON1 {
   unsigned int RD:1;
   unsigned int WR:1;
   unsigned int WREN:1;
   unsigned int WRERR:1;
   unsigned int FREE:1;
   unsigned int LWLO:1;
   unsigned int NVMREGS:1;
} NVMCON1;
#byte NVMCON1 = 0x81E

#byte NVMCON2 = 0x81F

struct CPUDOZE {
   unsigned int DOZE:3;
   unsigned int :1;
   unsigned int DOE:1;
   unsigned int ROI:1;
   unsigned int DOZEN:1;
   unsigned int IDLEN:1;
} CPUDOZE;
#byte CPUDOZE = 0x88C

struct OSCCON1 {
   unsigned int NDIV:4;
   unsigned int NOSC:3;
} OSCCON1;
#byte OSCCON1 = 0x88D

struct OSCCON2 {
   unsigned int CDIV:4;
   unsigned int COSC:3;
} OSCCON2;
#byte OSCCON2 = 0x88E

struct OSCCON3 {
   unsigned int :3;
   unsigned int NOSCR:1;
   unsigned int ORDY:1;
   unsigned int :1;
   unsigned int SOSCPWR:1;
   unsigned int CSWHOLD:1;
} OSCCON3;
#byte OSCCON3 = 0x88F

struct OSCSTAT {
   unsigned int PLLR:1;
   unsigned int :1;
   unsigned int ADOR:1;
   unsigned int SOR:1;
   unsigned int LFOR:1;
   unsigned int MFOR:1;
   unsigned int HFOR:1;
   unsigned int EXTOR:1;
} OSCSTAT;
#byte OSCSTAT = 0x890

struct OSCEN {
   unsigned int :2;
   unsigned int ADOEN:1;
   unsigned int SOSCEN:1;
   unsigned int LFOEN:1;
   unsigned int MFOEN:1;
   unsigned int HFOEN:1;
   unsigned int EXTOEN:1;
} OSCEN;
#byte OSCEN = 0x891

#byte OSCTUNE = 0x892

