PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
#byte OSCFRQ = 0x893

struct CLKRCON {
   unsigned int CLKRDIV:3;
   unsigned int CLKRDC:2;
   unsigned int :2;
   unsigned int CLKREN:1;
} CLKRCON;
#byte CLKRCON = 0x895

#byte MDSRC = 0x899

#word MDCAR = 0x89A

struct FVRCON {
   unsigned int ADFVR:2;
   unsigned int CDAFVR:2;
   unsigned int TSRNG:1;
   unsigned int TSEN:1;
   unsigned int FVRRDY:1;
   unsigned int FVREN:1;
} FVRCON;
#byte FVRCON = 0x90C

struct DAC1CON0 {
   union {
      struct {
         unsigned int NSS:1;
         unsigned int :1;
         unsigned int PSS:2;
         unsigned int OE2:1;
         unsigned int OE1:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int DAC1NSS:1;
         unsigned int :1;
         unsigned int DAC1PSS:2;
         unsigned int DAC1OE2:1;
         unsigned int DAC1OE1:1;
         unsigned int :1;
         unsigned int DAC1EN:1;
      };
   };
} DAC1CON0;
#byte DAC1CON0 = 0x90E

#byte DAC1CON1 = 0x90F

struct ZCD1CON {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int :2;
         unsigned int POL:1;
         unsigned int OUT:1;
         unsigned int :1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int ZCD1INTN:1;
         unsigned int ZCD1INTP:1;
         unsigned int :2;
         unsigned int ZCD1POL:1;
         unsigned int ZCD1OUT:1;
         unsigned int :1;
         unsigned int ZCD1EN:1;
      };
   };

      struct {
         unsigned int ZCDINTN:1;
         unsigned int ZCDINTP:1;
         unsigned int :2;
         unsigned int ZCDPOL:1;
         unsigned int ZCDOUT:1;
         unsigned int :1;
         unsigned int ZCDEN:1;
      };
   };
} ZCD1CON;
#byte ZCD1CON = 0x91F

struct CMOUT {
   union {
      struct {
         unsigned int MC1OUT:1;
         unsigned int MC2OUT:1;
      };

      struct {
         unsigned int C1OUT:1;
         unsigned int C2OUT:1;
      };
   };
} CMOUT;
#byte CMOUT = 0x98F

struct CM1CON0 {
   union {
      struct {
         unsigned int SYNC:1;
         unsigned int HYS:1;
         unsigned int Reserved:1;
         unsigned int ZLF:1;
         unsigned int POL:1;
         unsigned int OE:1;
         unsigned int OUT:1;
         unsigned int ON:1;
      };

      struct {
         unsigned int C1SYNC:1;
         unsigned int C1HYS:1;
         unsigned int C1SP:1;
         unsigned int C1ZLF:1;
         unsigned int C1POL:1;
         unsigned int C1OE:1;
         unsigned int C1OUT:1;
         unsigned int C1ON:1;
      };
   };
} CM1CON0;
#byte CM1CON0 = 0x990

struct CM1CON1 {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
      };

      struct {
         unsigned int C1INTN:1;
         unsigned int C1INTP:1;
      };
   };
} CM1CON1;
#byte CM1CON1 = 0x991

#byte CM1NSEL = 0x992

#byte CM1PSEL = 0x993

struct CM2CON0 {
   union {
      struct {
         unsigned int SYNC:1;
         unsigned int HYS:1;
         unsigned int Reserved:1;
         unsigned int ZLF:1;
         unsigned int POL:1;
         unsigned int OE:1;
         unsigned int OUT:1;
         unsigned int ON:1;
      };

      struct {
         unsigned int C2SYNC:1;
         unsigned int C2HYS:1;
         unsigned int C2SP:1;
         unsigned int C2ZLF:1;
         unsigned int C2POL:1;
         unsigned int C2OE:1;
         unsigned int C2OUT:1;
         unsigned int C2ON:1;
      };
   };
} CM2CON0;
#byte CM2CON0 = 0x994

struct CM2CON1 {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
      };

      struct {
         unsigned int C2INTN:1;
         unsigned int C2INTP:1;
      };
   };
} CM2CON1;
#byte CM2CON1 = 0x995

#byte CM2NSEL = 0x996

#byte CM2PSEL = 0x997

struct CLCDATA {
   unsigned int MLC1OUT:1;
   unsigned int MLC2OUT:1;
   unsigned int MLC3OUT:1;
   unsigned int MLC4OUT:1;
} CLCDATA;
#byte CLCDATA = 0xE0F

struct CLC1CON {
   union {
      struct {
         unsigned int LC1MODE:3;
         unsigned int LC1INTN:1;
         unsigned int LC1INTP:1;
         unsigned int LC1OUT:1;
         unsigned int LC1OE:1;
         unsigned int LC1EN:1;
      };

      struct {
         unsigned int MODE:3;
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };
   };
} CLC1CON;
#byte CLC1CON = 0xE10

struct CLC1POL {
   union {
      struct {
         unsigned int LC1G1POL:1;
         unsigned int LC1G2POL:1;
         unsigned int LC1G3POL:1;
         unsigned int LC1G4POL:1;
         unsigned int :3;
         unsigned int LC1POL:1;
      };

      struct {
         unsigned int G1POL:1;
         unsigned int G2POL:1;
         unsigned int G3POL:1;
         unsigned int G4POL:1;
         unsigned int :3;
         unsigned int POL:1;
      };
   };
} CLC1POL;
#byte CLC1POL = 0xE11

struct CLC1SEL0 {
   union {
      struct {
         unsigned int LC1D1S:8;
      };

      struct {
         unsigned int D1S:8;
      };
   };
} CLC1SEL0;
#byte CLC1SEL0 = 0xE12

struct CLC1SEL1 {
   union {
      struct {
         unsigned int LC1D2S:8;
      };

      struct {
         unsigned int D2S:8;
      };
   };
} CLC1SEL1;
#byte CLC1SEL1 = 0xE13

struct CLC1SEL2 {
   union {
      struct {
         unsigned int LC1D3S:8;
      };

      struct {
         unsigned int D3S:8;
      };
   };
} CLC1SEL2;
#byte CLC1SEL2 = 0xE14

struct CLC1SEL3 {
   union {
      struct {
         unsigned int LC1D4S:8;
      };

      struct {
         unsigned int D4S:8;
      };
   };
} CLC1SEL3;
#byte CLC1SEL3 = 0xE15

struct CLC1GLS0 {
   union {
      struct {
         unsigned int LC1G1D1N:1;
         unsigned int LC1G1D1T:1;
         unsigned int LC1G1D2N:1;
         unsigned int LC1G1D2T:1;
         unsigned int LC1G1D3N:1;
         unsigned int LC1G1D3T:1;
         unsigned int LC1G1D4N:1;
         unsigned int LC1G1D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC1GLS0;
#byte CLC1GLS0 = 0xE16

