PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
struct CLC1GLS1 {
   union {
      struct {
         unsigned int LC1G2D1N:1;
         unsigned int LC1G2D1T:1;
         unsigned int LC1G2D2N:1;
         unsigned int LC1G2D2T:1;
         unsigned int LC1G2D3N:1;
         unsigned int LC1G2D3T:1;
         unsigned int LC1G2D4N:1;
         unsigned int LC1G2D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC1GLS1;
#byte CLC1GLS1 = 0xE17

struct CLC1GLS2 {
   union {
      struct {
         unsigned int LC1G3D1N:1;
         unsigned int LC1G3D1T:1;
         unsigned int LC1G3D2N:1;
         unsigned int LC1G3D2T:1;
         unsigned int LC1G3D3N:1;
         unsigned int LC1G3D3T:1;
         unsigned int LC1G3D4N:1;
         unsigned int LC1G3D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC1GLS2;
#byte CLC1GLS2 = 0xE18

struct CLC1GLS3 {
   union {
      struct {
         unsigned int LC1G4D1N:1;
         unsigned int LC1G4D1T:1;
         unsigned int LC1G4D2N:1;
         unsigned int LC1G4D2T:1;
         unsigned int LC1G4D3N:1;
         unsigned int LC1G4D3T:1;
         unsigned int LC1G4D4N:1;
         unsigned int LC1G4D4T:1;
      };

      struct {
         unsigned int G4D1N:1;
         unsigned int G4D1T:1;
         unsigned int G4D2N:1;
         unsigned int G4D2T:1;
         unsigned int G4D3N:1;
         unsigned int G4D3T:1;
         unsigned int G4D4N:1;
         unsigned int G4D4T:1;
      };
   };
} CLC1GLS3;
#byte CLC1GLS3 = 0xE19

struct CLC2CON {
   union {
      struct {
         unsigned int LC2MODE:3;
         unsigned int LC2INTN:1;
         unsigned int LC2INTP:1;
         unsigned int LC2OUT:1;
         unsigned int LC2OE:1;
         unsigned int LC2EN:1;
      };

      struct {
         unsigned int MODE:3;
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };
   };
} CLC2CON;
#byte CLC2CON = 0xE1A

struct CLC2POL {
   union {
      struct {
         unsigned int LC2G1POL:1;
         unsigned int LC2G2POL:1;
         unsigned int LC2G3POL:1;
         unsigned int LC2G4POL:1;
         unsigned int :3;
         unsigned int LC2POL:1;
      };

      struct {
         unsigned int G1POL:1;
         unsigned int G2POL:1;
         unsigned int G3POL:1;
         unsigned int G4POL:1;
         unsigned int :3;
         unsigned int POL:1;
      };
   };
} CLC2POL;
#byte CLC2POL = 0xE1B

struct CLC2SEL0 {
   union {
      struct {
         unsigned int LC2D1S:8;
      };

      struct {
         unsigned int D1S:8;
      };
   };
} CLC2SEL0;
#byte CLC2SEL0 = 0xE1C

struct CLC2SEL1 {
   union {
      struct {
         unsigned int LC2D2S:8;
      };

      struct {
         unsigned int D2S:8;
      };
   };
} CLC2SEL1;
#byte CLC2SEL1 = 0xE1D

struct CLC2SEL2 {
   union {
      struct {
         unsigned int LC2D3S:8;
      };

      struct {
         unsigned int D3S:8;
      };
   };
} CLC2SEL2;
#byte CLC2SEL2 = 0xE1E

struct CLC2SEL3 {
   union {
      struct {
         unsigned int LC2D4S:8;
      };

      struct {
         unsigned int D4S:8;
      };
   };
} CLC2SEL3;
#byte CLC2SEL3 = 0xE1F

struct CLC2GLS0 {
   union {
      struct {
         unsigned int LC2G1D1N:1;
         unsigned int LC2G1D1T:1;
         unsigned int LC2G1D2N:1;
         unsigned int LC2G1D2T:1;
         unsigned int LC2G1D3N:1;
         unsigned int LC2G1D3T:1;
         unsigned int LC2G1D4N:1;
         unsigned int LC2G1D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC2GLS0;
#byte CLC2GLS0 = 0xE20

struct CLC2GLS1 {
   union {
      struct {
         unsigned int LC2G2D1N:1;
         unsigned int LC2G2D1T:1;
         unsigned int LC2G2D2N:1;
         unsigned int LC2G2D2T:1;
         unsigned int LC2G2D3N:1;
         unsigned int LC2G2D3T:1;
         unsigned int LC2G2D4N:1;
         unsigned int LC2G2D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC2GLS1;
#byte CLC2GLS1 = 0xE21

struct CLC2GLS2 {
   union {
      struct {
         unsigned int LC2G3D1N:1;
         unsigned int LC2G3D1T:1;
         unsigned int LC2G3D2N:1;
         unsigned int LC2G3D2T:1;
         unsigned int LC2G3D3N:1;
         unsigned int LC2G3D3T:1;
         unsigned int LC2G3D4N:1;
         unsigned int LC2G3D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC2GLS2;
#byte CLC2GLS2 = 0xE22

struct CLC2GLS3 {
   union {
      struct {
         unsigned int LC2G4D1N:1;
         unsigned int LC2G4D1T:1;
         unsigned int LC2G4D2N:1;
         unsigned int LC2G4D2T:1;
         unsigned int LC2G4D3N:1;
         unsigned int LC2G4D3T:1;
         unsigned int LC2G4D4N:1;
         unsigned int LC2G4D4T:1;
      };

      struct {
         unsigned int G4D1N:1;
         unsigned int G4D1T:1;
         unsigned int G4D2N:1;
         unsigned int G4D2T:1;
         unsigned int G4D3N:1;
         unsigned int G4D3T:1;
         unsigned int G4D4N:1;
         unsigned int G4D4T:1;
      };
   };
} CLC2GLS3;
#byte CLC2GLS3 = 0xE23

struct CLC3CON {
   union {
      struct {
         unsigned int LC3MODE:3;
         unsigned int LC3INTN:1;
         unsigned int LC3INTP:1;
         unsigned int LC3OUT:1;
         unsigned int LC3OE:1;
         unsigned int LC3EN:1;
      };

