PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int MODE:3;
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };
   };
} CLC3CON;
#byte CLC3CON = 0xE24

struct CLC3POL {
   union {
      struct {
         unsigned int LC3G1POL:1;
         unsigned int LC3G2POL:1;
         unsigned int LC3G3POL:1;
         unsigned int LC3G4POL:1;
         unsigned int :3;
         unsigned int LC3POL:1;
      };

      struct {
         unsigned int G1POL:1;
         unsigned int G2POL:1;
         unsigned int G3POL:1;
         unsigned int G4POL:1;
         unsigned int :3;
         unsigned int POL:1;
      };
   };
} CLC3POL;
#byte CLC3POL = 0xE25

struct CLC3SEL0 {
   union {
      struct {
         unsigned int LC3D1S:8;
      };

      struct {
         unsigned int D1S:8;
      };
   };
} CLC3SEL0;
#byte CLC3SEL0 = 0xE26

struct CLC3SEL1 {
   union {
      struct {
         unsigned int LC3D2S:8;
      };

      struct {
         unsigned int D2S:8;
      };
   };
} CLC3SEL1;
#byte CLC3SEL1 = 0xE27

struct CLC3SEL2 {
   union {
      struct {
         unsigned int LC3D3S:8;
      };

      struct {
         unsigned int D3S:8;
      };
   };
} CLC3SEL2;
#byte CLC3SEL2 = 0xE28

struct CLC3SEL3 {
   union {
      struct {
         unsigned int LC3D4S:8;
      };

      struct {
         unsigned int D4S:8;
      };
   };
} CLC3SEL3;
#byte CLC3SEL3 = 0xE29

struct CLC3GLS0 {
   union {
      struct {
         unsigned int LC3G1D1N:1;
         unsigned int LC3G1D1T:1;
         unsigned int LC3G1D2N:1;
         unsigned int LC3G1D2T:1;
         unsigned int LC3G1D3N:1;
         unsigned int LC3G1D3T:1;
         unsigned int LC3G1D4N:1;
         unsigned int LC3G1D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC3GLS0;
#byte CLC3GLS0 = 0xE2A

struct CLC3GLS1 {
   union {
      struct {
         unsigned int LC3G2D1N:1;
         unsigned int LC3G2D1T:1;
         unsigned int LC3G2D2N:1;
         unsigned int LC3G2D2T:1;
         unsigned int LC3G2D3N:1;
         unsigned int LC3G2D3T:1;
         unsigned int LC3G2D4N:1;
         unsigned int LC3G2D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC3GLS1;
#byte CLC3GLS1 = 0xE2B

struct CLC3GLS2 {
   union {
      struct {
         unsigned int LC3G3D1N:1;
         unsigned int LC3G3D1T:1;
         unsigned int LC3G3D2N:1;
         unsigned int LC3G3D2T:1;
         unsigned int LC3G3D3N:1;
         unsigned int LC3G3D3T:1;
         unsigned int LC3G3D4N:1;
         unsigned int LC3G3D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC3GLS2;
#byte CLC3GLS2 = 0xE2C

struct CLC3GLS3 {
   union {
      struct {
         unsigned int LC3G4D1N:1;
         unsigned int LC3G4D1T:1;
         unsigned int LC3G4D2N:1;
         unsigned int LC3G4D2T:1;
         unsigned int LC3G4D3N:1;
         unsigned int LC3G4D3T:1;
         unsigned int LC3G4D4N:1;
         unsigned int LC3G4D4T:1;
      };

      struct {
         unsigned int G4D1N:1;
         unsigned int G4D1T:1;
         unsigned int G4D2N:1;
         unsigned int G4D2T:1;
         unsigned int G4D3N:1;
         unsigned int G4D3T:1;
         unsigned int G4D4N:1;
         unsigned int G4D4T:1;
      };
   };
} CLC3GLS3;
#byte CLC3GLS3 = 0xE2D

struct CLC4CON {
   union {
      struct {
         unsigned int LC4MODE:3;
         unsigned int LC4INTN:1;
         unsigned int LC4INTP:1;
         unsigned int LC4OUT:1;
         unsigned int LC4OE:1;
         unsigned int LC4EN:1;
      };

      struct {
         unsigned int MODE:3;
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };
   };
} CLC4CON;
#byte CLC4CON = 0xE2E

struct CLC4POL {
   union {
      struct {
         unsigned int LC4G1POL:1;
         unsigned int LC4G2POL:1;
         unsigned int LC4G3POL:1;
         unsigned int LC4G4POL:1;
         unsigned int :3;
         unsigned int LC4POL:1;
      };

      struct {
         unsigned int G1POL:1;
         unsigned int G2POL:1;
         unsigned int G3POL:1;
         unsigned int G4POL:1;
         unsigned int :3;
         unsigned int POL:1;
      };
   };
} CLC4POL;
#byte CLC4POL = 0xE2F

struct CLC4SEL0 {
   union {
      struct {
         unsigned int LC4D1S:8;
      };

      struct {
         unsigned int D1S:8;
      };
   };
} CLC4SEL0;
#byte CLC4SEL0 = 0xE30

struct CLC4SEL1 {
   union {
      struct {
         unsigned int LC4D2S:8;
      };

      struct {
         unsigned int D2S:8;
      };
   };
} CLC4SEL1;
#byte CLC4SEL1 = 0xE31

struct CLC4SEL2 {
   union {
      struct {
         unsigned int LC4D3S:8;
      };

      struct {
         unsigned int D3S:8;
      };
   };
} CLC4SEL2;
#byte CLC4SEL2 = 0xE32

struct CLC4SEL3 {
   union {
      struct {
         unsigned int LC4D4S:8;
      };

      struct {
         unsigned int D4S:8;
      };
   };
} CLC4SEL3;
#byte CLC4SEL3 = 0xE33

struct CLC4GLS0 {
   union {
      struct {
         unsigned int LC4G1D1N:1;
         unsigned int LC4G1D1T:1;
         unsigned int LC4G1D2N:1;
         unsigned int LC4G1D2T:1;
         unsigned int LC4G1D3N:1;
         unsigned int LC4G1D3T:1;
         unsigned int LC4G1D4N:1;
         unsigned int LC4G1D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS0;
#byte CLC4GLS0 = 0xE34

struct CLC4GLS1 {
   union {
      struct {
         unsigned int LC4G2D1N:1;
         unsigned int LC4G2D1T:1;
         unsigned int LC4G2D2N:1;
         unsigned int LC4G2D2T:1;
         unsigned int LC4G2D3N:1;
         unsigned int LC4G2D3T:1;
         unsigned int LC4G2D4N:1;
         unsigned int LC4G2D4T:1;
      };

