PicTrance/GitHubYoutube/CCS/LCD_i2c_temp/PIC16F18855_registe.h
      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS1;
#byte CLC4GLS1 = 0xE35

struct CLC4GLS2 {
   union {
      struct {
         unsigned int LC4G3D1N:1;
         unsigned int LC4G3D1T:1;
         unsigned int LC4G3D2N:1;
         unsigned int LC4G3D2T:1;
         unsigned int LC4G3D3N:1;
         unsigned int LC4G3D3T:1;
         unsigned int LC4G3D4N:1;
         unsigned int LC4G3D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS2;
#byte CLC4GLS2 = 0xE36

struct CLC4GLS3 {
   union {
      struct {
         unsigned int LC4G4D1N:1;
         unsigned int LC4G4D1T:1;
         unsigned int LC4G4D2N:1;
         unsigned int LC4G4D2T:1;
         unsigned int LC4G4D3N:1;
         unsigned int LC4G4D3T:1;
         unsigned int LC4G4D4N:1;
         unsigned int LC4G4D4T:1;
      };

      struct {
         unsigned int G4D1N:1;
         unsigned int G4D1T:1;
         unsigned int G4D2N:1;
         unsigned int G4D2T:1;
         unsigned int G4D3N:1;
         unsigned int G4D3T:1;
         unsigned int G4D4N:1;
         unsigned int G4D4T:1;
      };
   };
} CLC4GLS3;
#byte CLC4GLS3 = 0xE37

struct PPSLOCK {
   unsigned int PPSLOCKED:1;
} PPSLOCK;
#byte PPSLOCK = 0xE8F

#byte INTPPS = 0xE90

#byte T0CKIPPS = 0xE91

#byte T1CKIPPS = 0xE92

#byte T1GPPS = 0xE93

#byte T3CKIPPS = 0xE94

#byte T3GPPS = 0xE95

#byte T5CKIPPS = 0xE96

#byte T5GPPS = 0xE97

#byte CCP1PPS = 0xEA1

#byte CCP2PPS = 0xEA2

#byte CCP3PPS = 0xEA3

#byte CCP4PPS = 0xEA4

#byte SMT1WINPPS = 0xEA9

#byte SMT1SIGPPS = 0xEAA

#byte SMT2WINPPS = 0xEAB

#byte SMT2SIGPPS = 0xEAC

#byte CWG1PPS = 0xEB1

#byte CWG2PPS = 0xEB2

#byte CLCIN0PPS = 0xEBB

#byte CLCIN1PPS = 0xEBC

#byte CLCIN2PPS = 0xEBD

#byte CLCIN3PPS = 0xEBE

#byte ADCACTPPS = 0xEC3

#byte SSP1CLKPPS = 0xEC5

#byte SSP1DATPPS = 0xEC6

#byte SSP1SSPPS = 0xEC7

#byte SSP2CLKPPS = 0xEC8

#byte SSP2DATPPS = 0xEC9

#byte SSP2SSPPS = 0xECA

#byte RXPPS = 0xECB

#byte TXPPS = 0xECC

#byte RA0PPS = 0xF10

#byte RA1PPS = 0xF11

#byte RA2PPS = 0xF12

#byte RA3PPS = 0xF13

#byte RA4PPS = 0xF14

#byte RA5PPS = 0xF15

#byte RA6PPS = 0xF16

#byte RA7PPS = 0xF17

#byte RB0PPS = 0xF18

#byte RB1PPS = 0xF19

#byte RB2PPS = 0xF1A

#byte RB3PPS = 0xF1B

#byte RB4PPS = 0xF1C

#byte RB5PPS = 0xF1D

#byte RB6PPS = 0xF1E

#byte RB7PPS = 0xF1F

#byte RC0PPS = 0xF20

#byte RC2PPS = 0xF22

#byte RC3PPS = 0xF23

#byte RC4PPS = 0xF24

#byte RC5PPS = 0xF25

#byte RC6PPS = 0xF26

#byte RC7PPS = 0xF27

struct ANSELA {
   unsigned int ANSA:8;
} ANSELA;
#byte ANSELA = 0xF38

struct WPUA {
   unsigned int WPUA:8;
} WPUA;
#byte WPUA = 0xF39

struct ODCONA {
   unsigned int ODCA:8;
} ODCONA;
#byte ODCONA = 0xF3A

struct SLRCONA {
   unsigned int SLRA:8;
} SLRCONA;
#byte SLRCONA = 0xF3B

struct INLVLA {
   unsigned int INLVLA:8;
} INLVLA;
#byte INLVLA = 0xF3C

struct IOCAP {
   unsigned int IOCAP:8;
} IOCAP;
#byte IOCAP = 0xF3D

struct IOCAN {
   unsigned int IOCAN:8;
} IOCAN;
#byte IOCAN = 0xF3E

struct IOCAF {
   unsigned int IOCAF:8;
} IOCAF;
#byte IOCAF = 0xF3F

struct CCDNA {
   unsigned int CCDNA:8;
} CCDNA;
#byte CCDNA = 0xF40

struct CCDPA {
   unsigned int CCDPA:8;
} CCDPA;
#byte CCDPA = 0xF41

struct ANSELB {
   unsigned int ANSB:8;
} ANSELB;
#byte ANSELB = 0xF43

struct WPUB {
   unsigned int WPUB:8;
} WPUB;
#byte WPUB = 0xF44

struct ODCONB {
   unsigned int ODCB:8;
} ODCONB;
#byte ODCONB = 0xF45

struct SLRCONB {
   unsigned int SLRB:8;
} SLRCONB;
#byte SLRCONB = 0xF46

struct INLVLB {
   unsigned int INLVLB:8;
} INLVLB;
#byte INLVLB = 0xF47

struct IOCBP {
   unsigned int IOCBP:8;
} IOCBP;
#byte IOCBP = 0xF48

struct IOCBN {
   unsigned int IOCBN:8;
} IOCBN;
#byte IOCBN = 0xF49

struct IOCBF {
   unsigned int IOCBF:8;
} IOCBF;
#byte IOCBF = 0xF4A

struct CCDNB {
   unsigned int CCDNB:8;
} CCDNB;
#byte CCDNB = 0xF4B

struct CCDPB {
   unsigned int CCDPB:8;
} CCDPB;
#byte CCDPB = 0xF4C

struct ANSELC {
   unsigned int ANSC:8;
} ANSELC;
#byte ANSELC = 0xF4E

struct WPUC {
   unsigned int WPUC:8;
} WPUC;
#byte WPUC = 0xF4F

struct ODCONC {
   unsigned int ODCC:8;
} ODCONC;
#byte ODCONC = 0xF50

struct SLRCONC {
   unsigned int SLRC:8;
} SLRCONC;
#byte SLRCONC = 0xF51

struct INLVLC {
   unsigned int INLVLC:8;
} INLVLC;
#byte INLVLC = 0xF52

struct IOCCP {
   unsigned int IOCCP:8;
} IOCCP;
#byte IOCCP = 0xF53

struct IOCCN {
   unsigned int IOCCN:8;
} IOCCN;
#byte IOCCN = 0xF54

struct IOCCF {
   unsigned int IOCCF:8;
} IOCCF;
#byte IOCCF = 0xF55

struct CCDNC {
   unsigned int CCDNC:8;
} CCDNC;
#byte CCDNC = 0xF56

struct CCDPC {
   unsigned int CCDPC:8;
} CCDPC;
#byte CCDPC = 0xF57

struct WPUE {
   unsigned int :3;
   unsigned int WPUE3:1;
} WPUE;
#byte WPUE = 0xF65

struct INLVLE {
   unsigned int :3;
   unsigned int INLVLE3:1;
} INLVLE;
#byte INLVLE = 0xF68

struct IOCEP {
   unsigned int :3;
   unsigned int IOCEP3:1;
} IOCEP;
#byte IOCEP = 0xF69

struct IOCEN {
   unsigned int :3;
   unsigned int IOCEN3:1;
} IOCEN;
#byte IOCEN = 0xF6A

struct IOCEF {
   unsigned int :3;
   unsigned int IOCEF3:1;
} IOCEF;
#byte IOCEF = 0xF6B

struct STATUS_SHAD {
   unsigned int C_SHAD:1;
   unsigned int DC_SHAD:1;
   unsigned int Z_SHAD:1;
} STATUS_SHAD;
#byte STATUS_SHAD = 0xFE4

#byte WREG_SHAD = 0xFE5

#byte BSR_SHAD = 0xFE6

#byte PCLATH_SHAD = 0xFE7

#byte FSR0L_SHAD = 0xFE8

#byte FSR0H_SHAD = 0xFE9

#byte FSR1L_SHAD = 0xFEA

#byte FSR1H_SHAD = 0xFEB

#byte STKPTR = 0xFED

#word TOS = 0xFEE

